(const studentsDatabase = {
                        "second": {
                "scientific": {
                    
                    
                    
                    
                    
                   
  

   "30810011810434": {
    "name": "طارق عبد الناصر فهيم راغب ",
    "scores": {
      "اللغة العربية": 60,
      "اللغة الأجنبية الأولى": 49,
      "الرياضيات": 50,
      "الأحياء": 55,
      "الفيزياء": 45,
      "الكيمياء": 49
    }
   },
"30809162100333": {
    "name": "يوسف خالد جابر إبراهيم سيد احمد ",
    "scores": {
      "اللغة العربية": 60,
      "اللغة الأجنبية الأولى": 40,
      "الرياضيات": 45,
      "الأحياء": 43,
      "الفيزياء": 46,
      "الكيمياء": 46
    }   },
            "698": {
    "name": "مؤمن أحمد مسعد أحمد",
    "scores": {
      "اللغة العربية": 68,
      "اللغة الأجنبية الأولى": 53,
      "الرياضيات": 49,
      "الأحياء": 51,
      "الفيزياء": 48,
      "الكيمياء": 52
    }    },
    
                
                            


                    
                    
            }
                
            }
        };

       
