
const studentsDatabase = {
            "first": {
                "214": {
                    "name": "مازن خالد حماده عبدالرحمن السمخراطي",
                    "scores": {
                        
                  "اللغة العربية": 60,
      "اللغة الإنجليزية": 59,
      "الرياضيات": 59,
      "العلوم المتكامله": 60,
      "التاريخ": 59,
      "الجغرافيا": 58
                        
                        
                        
                        
                    }
                },
                "12346": {
                    "name": "فاطمة أحمد حسن",
                    "scores": {
                        "اللغة العربية": 19,
                        "اللغة الإنجليزية": 18,
                        "الرياضيات": 17,
                        "الفيزياء": 18,
                        "الكيمياء": 19,
                        "الأحياء": 18,
                        "التاريخ": 17,
                        "الجغرافيا": 19
                    }
                }
            },
            "second": {
                "scientific": {
                    
                    
                    
                    
            
  "30810011810434": {
    "name": "طارق عبد الناصر فهيم راغب ",
    "scores": {
      "اللغة العربية": 70,
      "اللغة الأجنبية الأولى": 49,
      "الرياضيات": 50,
      "الأحياء": 51,
      "الفيزياء": 40,
      "الكيمياء": 40
    }
  },
                            
  "748": {
    "name": "عبدالرحمن جلال عوض زهران",
    "scores": {
      "اللغة العربية": 65,
      "اللغة الأجنبية الأولى": 50,
      "الرياضيات": 44,
      "الأحياء": 50,
      "الفيزياء": 53,
      "الكيمياء": 55
    }
  }
,
                            



  "700": {
    "name": "يوسف رمضان سعد عرابى",
    "scores": {
      "اللغة العربية": 74,
      "اللغة الأجنبية الأولى": 56,
      "الرياضيات": 48,
      "الأحياء": 54,
      "الفيزياء": 49,
      "الكيمياء": 53
    }
  }
,

  "723": {
    "name": "أحمد كارم جبيلي محمد عبدالنبي",
    "scores": {
      "اللغة العربية": 72,
      "اللغة الأجنبية الأولى": 45,
      "الرياضيات": 51,
      "الأحياء": 49,
      "الفيزياء": 48,
      "الكيمياء": 52
    }
  }
,


"690": {
    "name": "ناجي سليمان ناجي فنيار",
    "scores": {
      "اللغة العربية": 71,
      "اللغة الأجنبية الأولى": 52,
      "الرياضيات": 51,
      "الأحياء": 53,
      "الفيزياء": 50,
      "الكيمياء": 52
    }
  }

        
                   
  

                       
                },
                "literary": {
                    "34567": {
                        "name": "زينب محمد إبراهيم",
                        "scores": {
                            "اللغة العربية": 19,
                            "اللغة الإنجليزية": 18,
                            "التاريخ": 20,
                            "الجغرافيا": 19,
                            "الفلسفة": 18,
                            "علم النفس": 19,
                            "اللغة الفرنسية": 17
                        }
                    }
                }
            }
        };

       
       
